mdhardenburgh/Blinky/Packages/.cache/Keil.STM32G4xx_DFP.1.1.0.pdsc
      <component Cgroup="Drivers" Csub="QSPI"               condition="STM32G474E-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                 condition="STM32G474E-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Smartcard"          condition="STM32G474E-EVAL BSP Smartcard">
        <description>uSD for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_smartcard.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"               condition="STM32G474E-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="USBPD"              condition="STM32G474E-EVAL BSP USBPD">
        <description>USB Type-C / USB Power Delivery for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_usbpd_pwr.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_usbpd_pwr.c"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="STM32G474E-EVAL LED">
      <description>LED driver for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32G474E-EVAL/Common/LED_STM32G474E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="STM32G474E-EVAL Buttons">
      <description>Button driver for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32G474E-EVAL/Common/Buttons_STM32G474E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0" condition="STM32G474E-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32G474E-EVAL/Common/Joystick_STM32G474E-EVAL.c"/>
        </files>
      </component>
<!--
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32G474E-EVAL ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32G474E-EVAL/Common/ADC_STM32G474E-EVAL.c"/>
        </files>
      </component>
-->
    </bundle>

  </components>

  <boards>
    <!-- STM32G474E-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32G474E-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32G474E-EVAL</description>
<!--
      <image small="MDK/Boards/ST/STM32G474E-EVAL/Documentation/stm32g474e-eval_small.jpg"
             large="MDK/Boards/ST/STM32G474E-EVAL/Documentation/stm32g474e-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF261634" title="Web Page"/>
      <book category="schematic" name="MDK/Boards/ST/STM32G474E-EVAL/Documentation/?.pdf" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32G474E-EVAL/Documentation/?.pdf" title="User Manual"/>
-->
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32G474QETx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32G474"/>
<!--
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
-->
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32G474E-EVAL Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32G474E-EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32G474E-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
